arduino/arduino-cli/internal/integrationtest/debug/testdata/hardware/my/samd/boards.txt
my.name=My Cool Board
my.vid.0=0x2341
my.pid.0=0x804e
my.upload_port.0.vid=0x2341
my.upload_port.0.pid=0x804e
my.upload.tool=bossac
my.upload.tool.default=bossac
my.upload.tool.network=arduino_ota
my.upload.protocol=sam-ba
my.upload.maximum_size=262144
my.upload.maximum_data_size=32768
my.upload.use_1200bps_touch=true
my.upload.wait_for_upload_port=true
my.upload.native_usb=true
my.build.mcu=cortex-m0plus
my.build.f_cpu=48000000L
my.build.usb_product="Arduino MKR1000"
my.build.usb_manufacturer="Arduino LLC"
my.build.board=SAMD_MY
my.build.core=arduino:arduino
my.build.extra_flags=-DUSE_ARDUINO_MKR_PIN_LAYOUT -D__SAMD21G18A__ {build.usb_flags}
my.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
my.build.openocdscript=openocd_scripts/arduino_zero.cfg
my.build.variant=arduino:mkr1000
my.build.vid=0x2341
my.build.pid=0x804e

my.debug.toolchain.path=gcc-path
my.debug.toolchain.prefix=gcc-prefix
my.debug.server.openocd.path=openocd-path
my.debug.server.openocd.scripts_dir=openocd-scripts-dir
my.debug.server.openocd.script=
my.debug.server.openocd.scripts.0=first
my.debug.server.openocd.scripts.1=second
my.debug.server.openocd.scripts.2=third
my.debug.server.openocd.scripts.5=fourth
my.debug.cortex-debug.custom.postAttachCommands.0=set remote hardware-watchpoint-limit 2
my.debug.cortex-debug.custom.postAttachCommands.1=monitor reset halt
my.debug.cortex-debug.custom.postAttachCommands.2=monitor gdb_sync
my.debug.cortex-debug.custom.postAttachCommands.3=thb setup
my.debug.cortex-debug.custom.postAttachCommands.4=c
my.debug.cortex-debug.custom.overrideRestartCommands.0=monitor reset halt
my.debug.cortex-debug.custom.overrideRestartCommands.1=monitor gdb_sync
my.debug.cortex-debug.custom.overrideRestartCommands.2=thb setup
my.debug.cortex-debug.custom.overrideRestartCommands.3=c
my.debug.cortex-debug.custom.anotherStringParamer=hellooo
my.debug.cortex-debug.custom.aBoolean=[boolean]true
my.debug.cortex-debug.custom.aStringBoolean=true
my.debug.cortex-debug.custom.aNumber=[number]10
my.debug.cortex-debug.custom.anotherNumber=[number]10.20
my.debug.cortex-debug.custom.aStringNumber=10
my.debug.cortex-debug.custom.anObject=[object]{"key":"value", "boolean":true}
my.debug.cortex-debug.custom.anotherObject.key=value
my.debug.cortex-debug.custom.anotherObject.boolean=[boolean]true
my.debug.svd_file=svd-file

my2.name=My Cool Board
my2.vid.0=0x2341
my2.pid.0=0x804e
my2.upload_port.0.vid=0x2341
my2.upload_port.0.pid=0x804e
my2.upload.tool=bossac
my2.upload.tool.default=bossac
my2.upload.tool.network=arduino_ota
my2.upload.protocol=sam-ba
my2.upload.maximum_size=262144
my2.upload.maximum_data_size=32768
my2.upload.use_1200bps_touch=true
my2.upload.wait_for_upload_port=true
my2.upload.native_usb=true
my2.build.mcu=cortex-m0plus
my2.build.f_cpu=48000000L
my2.build.usb_product="Arduino MKR1000"
my2.build.usb_manufacturer="Arduino LLC"
my2.build.board=SAMD_MY
my2.build.core=arduino:arduino
my2.build.extra_flags=-DUSE_ARDUINO_MKR_PIN_LAYOUT -D__SAMD21G18A__ {build.usb_flags}
my2.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
my2.build.openocdscript=openocd_scripts/arduino_zero.cfg
my2.build.variant=arduino:mkr1000
my2.build.vid=0x2341
my2.build.pid=0x804e

my2.debug.toolchain.path=gcc-path
my2.debug.toolchain.prefix=gcc-prefix
my2.debug.server.openocd.path=openocd-path
my2.debug.server.openocd.scripts_dir=openocd-scripts-dir
my2.debug.server.openocd.script=single-script
my2.debug.svd_file=svd-file

my3.name=My third Cool Board
my3.build.core=arduino:arduino
my3.build.variant=arduino:mkr1000
my3.debug.toolchain.path=gcc-path
my3.debug.toolchain.prefix=gcc-prefix
my3.debug.server.openocd.path=openocd-path
my3.debug.server.openocd.scripts_dir=openocd-scripts-dir
my3.debug.server.openocd.script=single-script
# this one will be overwritten by additional_config
my3.debug.svd_file=svd-file
my3.debug.additional_config=build.debug.config.test1

my4.name=My fourth Cool Board
my4.build.core=arduino:arduino
my4.build.variant=arduino:mkr1000
my4.debug.toolchain.path=gcc-path
my4.debug.toolchain.prefix=gcc-prefix
my4.debug.server.openocd.path=openocd-path
my4.debug.server.openocd.scripts_dir=openocd-scripts-dir
my4.debug.server.openocd.script=single-script
my4.build.mcu=test2
# this one will be overwritten by additional_config
my4.debug.svd_file=svd-file
my4.debug.additional_config=build.debug.config.{build.mcu}

# menu options for the following boards
menu.dbg=Debugger
menu.cpu=CPU Speed

# This does not support debug by default but only after selecting a menu option
my5.name=5th Board
my5.build.core=arduino:arduino
my5.build.variant=arduino:mkr1000
my5.debug.toolchain.path=gcc-path
my5.debug.toolchain.prefix=gcc-prefix
my5.debug.server.openocd.path=openocd-path
my5.debug.server.openocd.scripts_dir=openocd-scripts-dir
my5.debug.server.openocd.script=single-script
my5.debug.executable=
my5.menu.dbg.off=Debug Disabled
my5.menu.dbg.on=Debug Enabled
my5.menu.dbg.on.debug.executable=YES
my5.menu.cpu.100m=100Mhz
my5.menu.cpu.150m=150Mhz

# this one has debugger enabled by default
my6.name=5th Board
my6.build.core=arduino:arduino
my6.build.variant=arduino:mkr1000
my6.debug.toolchain.path=gcc-path
my6.debug.toolchain.prefix=gcc-prefix
my6.debug.server.openocd.path=openocd-path
my6.debug.server.openocd.scripts_dir=openocd-scripts-dir
my6.debug.server.openocd.script=single-script
my6.debug.executable=
my6.menu.dbg.on=Debug Enabled
my6.menu.dbg.on.debug.executable=YES
my6.menu.dbg.off=Debug Disabled
my6.menu.cpu.100m=100Mhz
my6.menu.cpu.150m=150Mhz